# Subsetting

Review core methods to select data from a `pandas.Dataframe`

## Read in CSV 
To read in CSV file into our Python workspace as a `pandas.Dataframe` use `pandas.read_csv` function

In [1]:
import pandas as pd

# Read in file, argument is the file path as a string
df = pd.read_csv('data/wetlands_seasonal_bird_diversity.csv')

# Print df's first five rows
df.head()

,year,CSM_winter,CSM_spring,CSM_fall,MUL_winter,MUL_spring,MUL_fall,SDW_winter,SDW_spring,SDW_fall,TJE_winter,TJE_spring,TJE_fall
0,2010,39.0,40.0,50.0,45.0,NaN,61.0,NaN,75.0,85.0,NaN,NaN,81.0
1,2011,48.0,44.0,NaN,58.0,52.0,NaN,78.0,74.0,NaN,67.0,70.0,NaN
2,2012,51.0,43.0,49.0,57.0,58.0,53.0,71.0,72.0,73.0,70.0,63.0,69.0
3,2013,42.0,46.0,38.0,60.0,58.0,62.0,69.0,70.0,70.0,69.0,74.0,64.0
4,2014,38.0,43.0,45.0,49.0,52.0,57.0,61.0,78.0,71.0,60.0,81.0,62.0

Birds that were surveyed in 4 wetlands for a restoration project at a nuclear powerplant
- Carpinteria salt marsh (CSM)
- Mugu weland (MUL)
- San Dieguito Wetland (SDW)
- Tijuana Estuary (TJE)

Values from second to last column = number of different bird species recorded across survey sites in each wetland during each season for a given year

year column = year on which data was collected

In [2]:
# Print the df column names
df.columns

Index(['year', 'CSM_winter', 'CSM_spring', 'CSM_fall', 'MUL_winter',
       'MUL_spring', 'MUL_fall', 'SDW_winter', 'SDW_spring', 'SDW_fall',
       'TJE_winter', 'TJE_spring', 'TJE_fall'],
      dtype='object')

In [3]:
# List the dftypes of each column
df.dtypes

year            int64
CSM_winter    float64
CSM_spring    float64
CSM_fall      float64
MUL_winter    float64
MUL_spring    float64
MUL_fall      float64
SDW_winter    float64
SDW_spring    float64
SDW_fall      float64
TJE_winter    float64
TJE_spring    float64
TJE_fall      float64
dtype: object

In [4]:
# Printh the df's shape: output is a tuple (# rows, # columns)
df.shape

(14, 13)

## Subsetting a single column

Simplest case: Select a single column by column name

General Syntax
```python
df['column_name']
```

This is an example of **label based subsetting**, which means we want to select data form our DF using the *names* of columns, not the position

### Example
Select number of bird species at Mugu Lagoon in spring`

In [5]:
# Select a single column by using square brackets []
mul_spring = df['MUL_spring']

mul_spring

0      NaN
1     52.0
2     58.0
3     58.0
4     52.0
5     50.0
6     48.0
7     54.0
8     54.0
9     52.0
10     NaN
11    55.0
12    55.0
13    59.0
Name: MUL_spring, dtype: float64

In [6]:
# Confirm the type of output
print(type(mul_spring))

<class 'pandas.core.series.Series'>

Recall: We can think of a `pandas.Daraframe` as a dictionary of its columns
THen, we can access a single column using the column name as the *key*, just like we would a dictionary:
    
    `df[column_name]`
We can also do label-based subsetting using attribute syntax

```python
df.column_name
```

Example:

In [7]:
df.MUL_spring

0      NaN
1     52.0
2     58.0
3     58.0
4     52.0
5     50.0
6     48.0
7     54.0
8     54.0
9     52.0
10     NaN
11    55.0
12    55.0
13    59.0
Name: MUL_spring, dtype: float64

**Favor `df['column_name']` instead of `df.column_name`**

Why?

- `df['column_name']` avoids conflicts with `pd.Dataframe` methods and attributes. For example, if `df` has a column named `count`, it's ambiguous whether `pd.count` is referring to `count` method or the `count` column
- `df['column_name']` can take any column name
- `df.column` only works if the column name has no spaces or special characters

## Selecting Multiple Columns

### ...using a list of column names

Select multiple columns in a single cell by passing a list of column names to square brackets `[]`

```python
df[ ['col1', 'col2', 'col3'] ]
```

Notice the 'double square brackets'. Second [] comes from passing the list of names to the selection brackets.

## Check in
Is this label based or position based? Label.


### Example

In [8]:
# Select column with names 'TJE_winter' and 'TJE_fall'

tje_wf = df[ ['TJE_winter', 'TJE_fall']]

tje_wf

    TJE_winter  TJE_fall
0          NaN      81.0
1         67.0       NaN
2         70.0      69.0
3         69.0      64.0
4         60.0      62.0
5         73.0      64.0
6         76.0      58.0
7         72.0      57.0
8         66.0      55.0
9         63.0      50.0
10        54.0      54.0
11        53.0      51.0
12        60.0      60.0
13        60.0      38.0

In [9]:
print(type(tje_wf))

<class 'pandas.core.frame.DataFrame'>

### ...using a slice
To select a slice of the columns we will use a special sace of **`loc` selections**. General syntax:
    
```python
df.loc[ : , 'column_start':'column_end']
```
'column_start' and "column_end" = the starting and ending point of the column slice we want to subset from the data frame

Notice

- the first value pass to `loc` is used for selecting rows, using a colon `:` as the row seleting parameter means "select all the rows"
- the slice of resulting data frame includes both endpoints of the slice

In [10]:
# Select columns between 'CSM_winter' and "MUL_fall"

csm_mul = df.loc[:, 'CSM_winter':'MUL_fall']

csm_mul

    CSM_winter  CSM_spring  CSM_fall  MUL_winter  MUL_spring  MUL_fall
0         39.0        40.0      50.0        45.0         NaN      61.0
1         48.0        44.0       NaN        58.0        52.0       NaN
2         51.0        43.0      49.0        57.0        58.0      53.0
3         42.0        46.0      38.0        60.0        58.0      62.0
4         38.0        43.0      45.0        49.0        52.0      57.0
5         44.0        42.0      45.0        58.0        50.0      51.0
6         41.0        36.0      47.0        63.0        48.0      58.0
7         46.0        41.0      43.0        57.0        54.0      53.0
8         48.0        48.0      44.0        56.0        54.0      57.0
9         39.0        39.0      40.0        57.0        52.0      53.0
10        46.0         NaN      47.0        56.0         NaN      66.0
11        47.0        44.0      53.0        54.0        55.0      60.0
12        40.0        46.0      49.0        60.0        55.0      65.0
13        56.0        43.0      36.0        72.0        59.0      53.0

## Selecting rows..

### ...using a condition
To select rows that satisfy a aprticular condition the general syntax is
```python
df[condition_on_rows]
```

The `codition_on_rows` can be many things, let's see some usual scenarios

### Example
We are interested in data after 2020

In [11]:
# select all rows with year greater than 2020
post_2020 = df[df['year'] > 2020]

post_2020

,year,CSM_winter,CSM_spring,CSM_fall,MUL_winter,MUL_spring,MUL_fall,SDW_winter,SDW_spring,SDW_fall,TJE_winter,TJE_spring,TJE_fall
11,2021,47.0,44.0,53.0,54.0,55.0,60.0,57.0,58.0,57.0,53.0,68.0,51.0
12,2022,40.0,46.0,49.0,60.0,55.0,65.0,57.0,60.0,57.0,60.0,61.0,60.0
13,2023,56.0,43.0,36.0,72.0,59.0,53.0,64.0,63.0,33.0,60.0,56.0,38.0

condition for our rows = `df['year'] > 2020`
this is a 'pandas.Series' with boolean values ('True' or 'False') indicating which rows satisfy the condition year > 2020

In [12]:
# Check the type of df['year'] > 2020
print(type(df['year'] > 2020))

<class 'pandas.core.series.Series'>

In [13]:
# Print boolean series
print(df['year'] > 2020)

0     False
1     False
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9     False
10    False
11     True
12     True
13     True
Name: year, dtype: bool

When we pass such a series of boolean values to the selection brackets `[]` we keep only the rows that correspond to a `True` value

## Check-in

Get the subset of the data frame on which the San Dieguito Wetland has at least 75 species recorded during spring

In [14]:
spring_75 = df[df['SDW_spring'] >= 75]
spring_75

,year,CSM_winter,CSM_spring,CSM_fall,MUL_winter,MUL_spring,MUL_fall,SDW_winter,SDW_spring,SDW_fall,TJE_winter,TJE_spring,TJE_fall
0,2010,39.0,40.0,50.0,45.0,NaN,61.0,NaN,75.0,85.0,NaN,NaN,81.0
4,2014,38.0,43.0,45.0,49.0,52.0,57.0,61.0,78.0,71.0,60.0,81.0,62.0

In [16]:
# Will return boolean values
df['SDW_spring'] >= 75

0      True
1     False
2     False
3     False
4      True
5     False
6     False
7     False
8     False
9     False
10    False
11    False
12    False
13    False
Name: SDW_spring, dtype: bool

#### Example

Suppose we want to look at data from year 2012 to 2015 including both years
We can use this `between` method in our condition

In [23]:
subset = df[df['year'].between(2012,2015)]
subset

,year,CSM_winter,CSM_spring,CSM_fall,MUL_winter,MUL_spring,MUL_fall,SDW_winter,SDW_spring,SDW_fall,TJE_winter,TJE_spring,TJE_fall
2,2012,51.0,43.0,49.0,57.0,58.0,53.0,71.0,72.0,73.0,70.0,63.0,69.0
3,2013,42.0,46.0,38.0,60.0,58.0,62.0,69.0,70.0,70.0,69.0,74.0,64.0
4,2014,38.0,43.0,45.0,49.0,52.0,57.0,61.0,78.0,71.0,60.0,81.0,62.0
5,2015,44.0,42.0,45.0,58.0,50.0,51.0,71.0,61.0,65.0,73.0,76.0,64.0

In [24]:
df['year'].between(2012,2015)

0     False
1     False
2      True
3      True
4      True
5      True
6     False
7     False
8     False
9     False
10    False
11    False
12    False
13    False
Name: year, dtype: bool

Let's break it down

1. df['year'] = column with the year values, a `pandas.Series`
2. in `df('year').between()` we are accessing a method for the `pandas.Series` method
3. (2012, 2015) = parameters, includes both endpoints
4. df['year'].between(2012,2015) = `pandas.Series` of boolean values indicating which rows have values between 2012 and 2015
5. When we put `df['year'].between(2012,2015)` inside selection brackets `[]` we obtain the rows we wanted to select

## Avoid using `loc` for selecting only rows
It is equivalent to write the following two

In [26]:
# Select rows with year < 2015 using a condition
df[df['year']<2015]

,year,CSM_winter,CSM_spring,CSM_fall,MUL_winter,MUL_spring,MUL_fall,SDW_winter,SDW_spring,SDW_fall,TJE_winter,TJE_spring,TJE_fall
0,2010,39.0,40.0,50.0,45.0,NaN,61.0,NaN,75.0,85.0,NaN,NaN,81.0
1,2011,48.0,44.0,NaN,58.0,52.0,NaN,78.0,74.0,NaN,67.0,70.0,NaN
2,2012,51.0,43.0,49.0,57.0,58.0,53.0,71.0,72.0,73.0,70.0,63.0,69.0
3,2013,42.0,46.0,38.0,60.0,58.0,62.0,69.0,70.0,70.0,69.0,74.0,64.0
4,2014,38.0,43.0,45.0,49.0,52.0,57.0,61.0,78.0,71.0,60.0,81.0,62.0

In [29]:
# Select rows with year < 2015 using loc
df.loc[df['year']<2015, :] # `:` tells you to select all columns

,year,CSM_winter,CSM_spring,CSM_fall,MUL_winter,MUL_spring,MUL_fall,SDW_winter,SDW_spring,SDW_fall,TJE_winter,TJE_spring,TJE_fall
0,2010,39.0,40.0,50.0,45.0,NaN,61.0,NaN,75.0,85.0,NaN,NaN,81.0
1,2011,48.0,44.0,NaN,58.0,52.0,NaN,78.0,74.0,NaN,67.0,70.0,NaN
2,2012,51.0,43.0,49.0,57.0,58.0,53.0,71.0,72.0,73.0,70.0,63.0,69.0
3,2013,42.0,46.0,38.0,60.0,58.0,62.0,69.0,70.0,70.0,69.0,74.0,64.0
4,2014,38.0,43.0,45.0,49.0,52.0,57.0,61.0,78.0,71.0,60.0,81.0,62.0

We prefer the first syntax because it is simpler.

### Select columns using multiple conditions

We can combine multiple conditions to select rows by surrounding each condition in parenthesis`()` and using the or operator `|` and the and operator `&`

## Example or
Select rows in which the CSM has more than 50 species registered in winter *or* fall

In [33]:
df[(df['CSM_winter']>50) | (df['CSM_fall']>50)]

,year,CSM_winter,CSM_spring,CSM_fall,MUL_winter,MUL_spring,MUL_fall,SDW_winter,SDW_spring,SDW_fall,TJE_winter,TJE_spring,TJE_fall
2,2012,51.0,43.0,49.0,57.0,58.0,53.0,71.0,72.0,73.0,70.0,63.0,69.0
11,2021,47.0,44.0,53.0,54.0,55.0,60.0,57.0,58.0,57.0,53.0,68.0,51.0
13,2023,56.0,43.0,36.0,72.0,59.0,53.0,64.0,63.0,33.0,60.0,56.0,38.0

## Example and
Select rows in which both the CSM and the SDW have more than 60 species during spring

In [36]:
df[(df['CSM_spring']>60) & (df['SDW_spring']>60)]

Empty DataFrame
Columns: [year, CSM_winter, CSM_spring, CSM_fall, MUL_winter, MUL_spring, MUL_fall, SDW_winter, SDW_spring, SDW_fall, TJE_winter, TJE_spring, TJE_fall]
Index: []

An empty data frame. OK because no rows satisfy the conditions

## Select rows by position

Sometimes we may want to select certain rows based on their *actual position* in the data frame, using a **position-based subsetting**

To do this we use **iloc selection** syntax:

```python
df.iloc[row-indicies]
```

`iloc` = integer-location based indexing

## Example

In [39]:
# Select the fifth row (index = 4)
df.iloc[4]

year          2014.0
CSM_winter      38.0
CSM_spring      43.0
CSM_fall        45.0
MUL_winter      49.0
MUL_spring      52.0
MUL_fall        57.0
SDW_winter      61.0
SDW_spring      78.0
SDW_fall        71.0
TJE_winter      60.0
TJE_spring      81.0
TJE_fall        62.0
Name: 4, dtype: float64

In [47]:
# Select rows from the 10th - 13th, including 13
df.iloc[9:14] # Goes one less than what you put

,year,CSM_winter,CSM_spring,CSM_fall,MUL_winter,MUL_spring,MUL_fall,SDW_winter,SDW_spring,SDW_fall,TJE_winter,TJE_spring,TJE_fall
9,2019,39.0,39.0,40.0,57.0,52.0,53.0,54.0,55.0,53.0,63.0,54.0,50.0
10,2020,46.0,NaN,47.0,56.0,NaN,66.0,57.0,NaN,58.0,54.0,40.0,54.0
11,2021,47.0,44.0,53.0,54.0,55.0,60.0,57.0,58.0,57.0,53.0,68.0,51.0
12,2022,40.0,46.0,49.0,60.0,55.0,65.0,57.0,60.0,57.0,60.0,61.0,60.0
13,2023,56.0,43.0,36.0,72.0,59.0,53.0,64.0,63.0,33.0,60.0,56.0,38.0

### Selecting rows and columns simultaneously

Can be done using `loc` (labels) or `iloc` (positions)

### Example...by labels or conditions
When we want to select rows and columns simultaneously by labels (including conditions) we can use `loc` 
```python
df.loc[ row-selection, column-selection]
```
Example: 
Select winter surveys from MUL and TJE after 2020

In [49]:
df.loc[df['year']>2020,['MUL_winter', "TJE_winter"]]

    MUL_winter  TJE_winter
11        54.0        53.0
12        60.0        60.0
13        72.0        60.0

## Selecting by position
Suppose we want to select rows 3-7, including 7, and columns 4th and 5th

In [52]:
df.iloc[3:8,[3,4]]

   CSM_fall  MUL_winter
3      38.0        60.0
4      45.0        49.0
5      45.0        58.0
6      47.0        63.0
7      43.0        57.0

## Notes about `iloc` and `loc`

### Which one does what?

Remember that the `i` in `iloc` stands for integer location and it uses integer indexxing the same way as indexxing for Python

### `iloc` for column selection? Avoid it!
We can also access columns by positoin using `iloc` - but best not to if possible

Example:
Access 9th column of data frame and access column by position

In [57]:
df.iloc[:,8]
df.iloc[8] # row 9

year          2018.0
CSM_winter      48.0
CSM_spring      48.0
CSM_fall        44.0
MUL_winter      56.0
MUL_spring      54.0
MUL_fall        57.0
SDW_winter      55.0
SDW_spring      49.0
SDW_fall        51.0
TJE_winter      66.0
TJE_spring      60.0
TJE_fall        55.0
Name: 8, dtype: float64

Unless you are *really* looking for info about the 9th column, **do not access a column by position**
1. it relies on you correctly counting the position of a column, prone to error!
2. it is not explicit: if we want info about that column then use `df[SDW_spring`